//COMPMS2 JOB MSGLEVEL=(1,1),NOTIFY=&SYSUID
//PLIB    JCLLIB ORDER=(KALA15.LOANAPP.PROCLIB)
//*
//*       ASSEMBLE LMAPST1 MAP FOR LOANFORM PROGRAM
//COMPMAP  EXEC DFHMAPS,MEMBER=LMAPST2
//*
