//COMPMS3 JOB MSGLEVEL=(1,1),NOTIFY=&SYSUID
//PLIB    JCLLIB ORDER=(KALA15.LOANAPP.PROCLIB)
//*
//*       ASSEMBLE LMAPST1 MAP FOR LOANSRCH PROGRAM
//COMPMAP  EXEC DFHMAPS,MEMBER=LMAPST3
//*
