//COMPDB2 JOB MSGLEVEL=(1,1),NOTIFY=&SYSUID
//PLIB    JCLLIB ORDER=(KALA15.LOANAPP.PROCLIB)
//********************************************************************
//*       COBOL + DB2 + CICS COMPILE JCL
//********************************************************************
//COMPILE EXEC DB2CICSC,MEMBER=LOANDB2
