//COMPSRCH JOB MSGLEVEL=(1,1),NOTIFY=&SYSUID
//PLIB    JCLLIB ORDER=(KALA15.LOANAPP.PROCLIB)
//*
//*  COMPILE LOANSEARCH CICS PROGRAM
//*
//CICSCOB EXEC CICSCOBC,MEMBER=LOANSRCH
//*
