//COMPMS1 JOB MSGLEVEL=(1,1),NOTIFY=&SYSUID
//PLIB    JCLLIB ORDER=(KALA15.LOANAPP.PROCLIB)
//*
//*       ASSEMBLE LMAPST1 MAP FOR LOANMENU PROGRAM
//COMPMAP  EXEC DFHMAPS,MEMBER=LMAPST1
//*
